# Exercise 1

## Connect Database

In [1]:
%load_ext sql 

%config SqlMagic.displaylimit = 5

In [2]:
%sql postgresql://postgres:12345@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [6]:
# set search path
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

### 1.Find all products where the buyPrice is greater than 50

In [7]:
%%sql

select * from products 
where buyPrice > 50

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

62 rows affected.

+-------------+--------------------------------------+--------------+--------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+----------+--------+--------------+
| productcode |             productname              | productscale |      productvendor       |                                                                                                                                                                                                                                                 productdescription                                                                                                                                                                                                                                                | quantityinstock | buyprice |  msrp  | productline  |
+-------------+--------------------------------------+--------------+--------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+----------+--------+--------------+
|   S10_1949  |       1952 Alpine Renault 1300       |     1:10     | Classic Metal Creations  |                                                                                                                                                                                  Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                                  |       7305      |  98.58   | 214.3  | Classic Cars |
|   S10_2016  |        1996 Moto Guzzi 1100i         |     1:10     | Highway 66 Mini Classics |                                                      Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leather seats, luggage rack, dual exhaust pipes, small saddle bag located on handle bars, two-tone paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.                                                      |       6625      |  68.99   | 118.94 | Motorcycles  |
|   S10_4698  | 2003 Harley-Davidson Eagle Drag Bike |     1:10     |    Red Start Diecast     | Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-color tampo-printed graphics, separate engine drive belts, free-turning front fork, rotating tires and rear racing slick, certificate of authenticity, detailed engine, display stand\r\n, precision diecast replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine |       5582      |  91.02   | 193.66 | Motorcycles  |
|   S10_4757  |         1972 Alfa Romeo GTA          |     1:10     | Motor City Art Classics  |                                                                                                                                                                         Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                         |       3252      |  85.68   |  136   | Classic Cars |
|   S10_4962  |        1962 LanciaA Delta 16V        |     1:10     |   Second Gear Diecast    |                                                                                                                                                                         Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                         |       6791      |  103.42  | 147.74 | Classic Cars |
+-------------+--------------------------------------+--------------+--------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+----------+--------+--------------+
Truncated to displaylimit of 5.

In [ ]:
%%sql

# solution
SELECT productCode, productName, buyPrice FROM products
WHERE buyPrice > 50;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

62 rows affected.

+-------------+--------------------------------------+----------+
| productcode |             productname              | buyprice |
+-------------+--------------------------------------+----------+
|   S10_1949  |       1952 Alpine Renault 1300       |  98.58   |
|   S10_2016  |        1996 Moto Guzzi 1100i         |  68.99   |
|   S10_4698  | 2003 Harley-Davidson Eagle Drag Bike |  91.02   |
|   S10_4757  |         1972 Alfa Romeo GTA          |  85.68   |
|   S10_4962  |        1962 LanciaA Delta 16V        |  103.42  |
+-------------+--------------------------------------+----------+
Truncated to displaylimit of 5.

### 2.Find all orders placed between January 1,2004 and December 31,2004

In [8]:
%%sql

select * from orders 
WHERE orderDate BETWEEN '2004-01-01' AND '2004-12-31';

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

151 rows affected.

+-------------+---------------------+---------------------+---------------------+---------+----------+----------------+
| ordernumber |      orderdate      |     requireddate    |     shippeddate     |  status | comments | customernumber |
+-------------+---------------------+---------------------+---------------------+---------+----------+----------------+
|    10208    | 2004-01-02 00:00:00 | 2004-01-11 00:00:00 | 2004-01-04 00:00:00 | Shipped |   None   |      146       |
|    10209    | 2004-01-09 00:00:00 | 2004-01-15 00:00:00 | 2004-01-12 00:00:00 | Shipped |   None   |      347       |
|    10210    | 2004-01-12 00:00:00 | 2004-01-22 00:00:00 | 2004-01-20 00:00:00 | Shipped |   None   |      177       |
|    10211    | 2004-01-15 00:00:00 | 2004-01-25 00:00:00 | 2004-01-18 00:00:00 | Shipped |   None   |      406       |
|    10212    | 2004-01-16 00:00:00 | 2004-01-24 00:00:00 | 2004-01-18 00:00:00 | Shipped |   None   |      141       |
+-------------+---------------------+---------------------+---------------------+---------+----------+----------------+
Truncated to displaylimit of 5.

In [10]:
%%sql

# solution
SELECT orderNumber, orderDate, customerNumber FROM orders
WHERE orderDate BETWEEN '2004-01-01' AND '2004-12-31';

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

151 rows affected.

+-------------+---------------------+----------------+
| ordernumber |      orderdate      | customernumber |
+-------------+---------------------+----------------+
|    10208    | 2004-01-02 00:00:00 |      146       |
|    10209    | 2004-01-09 00:00:00 |      347       |
|    10210    | 2004-01-12 00:00:00 |      177       |
|    10211    | 2004-01-15 00:00:00 |      406       |
|    10212    | 2004-01-16 00:00:00 |      141       |
+-------------+---------------------+----------------+
Truncated to displaylimit of 5.

### 3.Find all customers located in USA,France, or Germany

In [11]:
%%sql

SELECT customerNumber, customerName, country FROM customers
WHERE country IN ('USA', 'France', 'Germany');

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

61 rows affected.

+----------------+------------------------------+---------+
| customernumber |         customername         | country |
+----------------+------------------------------+---------+
|      103       |      Atelier graphique       |  France |
|      112       |      Signal Gift Stores      |   USA   |
|      119       |      La Rochelle Gifts       |  France |
|      124       | Mini Gifts Distributors Ltd. |   USA   |
|      128       |     Blauer See Auto, Co.     | Germany |
+----------------+------------------------------+---------+
Truncated to displaylimit of 5.

### 4.Find all employees whose job title contains the word "Sales" AND whose office code is either 1 or 2

In [12]:
%%sql

SELECT employeeNumber, firstName, lastName, jobTitle, officeCode FROM employees
WHERE jobTitle LIKE '%Sales%' 
  AND officeCode IN ('1', '2');

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+----------------+-----------+-----------+--------------------+------------+
| employeenumber | firstname |  lastname |      jobtitle      | officecode |
+----------------+-----------+-----------+--------------------+------------+
|      1056      |    Mary   | Patterson |      VP Sales      |     1      |
|      1143      |  Anthony  |    Bow    | Sales Manager (NA) |     1      |
|      1165      |   Leslie  |  Jennings |     Sales Rep      |     1      |
|      1166      |   Leslie  |  Thompson |     Sales Rep      |     1      |
|      1188      |   Julie   |  Firrelli |     Sales Rep      |     2      |
+----------------+-----------+-----------+--------------------+------------+
Truncated to displaylimit of 5.

### 5.Find all products from product line 'Classic Cars' where the quantity in stock is less than 1000 buy price is greater than 75.

In [18]:
%%sql

SELECT productCode, productName, productLine, quantityInStock, buyPrice FROM products
WHERE productLine = 'Classic Cars' 
  AND (quantityInStock < 1000 OR buyPrice > 75);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

14 rows affected.

+-------------+--------------------------+--------------+-----------------+----------+
| productcode |       productname        | productline  | quantityinstock | buyprice |
+-------------+--------------------------+--------------+-----------------+----------+
|   S10_1949  | 1952 Alpine Renault 1300 | Classic Cars |       7305      |  98.58   |
|   S10_4757  |   1972 Alfa Romeo GTA    | Classic Cars |       3252      |  85.68   |
|   S10_4962  |  1962 LanciaA Delta 16V  | Classic Cars |       6791      |  103.42  |
|   S12_1099  |    1968 Ford Mustang     | Classic Cars |        68       |  95.34   |
|   S12_1108  |    2001 Ferrari Enzo     | Classic Cars |       3619      |  95.59   |
+-------------+--------------------------+--------------+-----------------+----------+
Truncated to displaylimit of 5.